<!-- dflook/terraform-github-actions {"workspace":"opentofu-2","backend_type":"remote","backend":"2ddf9f7b6bb31ddca6a227cf59429c4cc6f7ba60c6737f596323250327b623cc","plan_job_ref":"Job Test Terraform cloud #176 at https://github.com/dflook/terraform-github-actions/actions/runs/6592484872","plan_hash":"daeef9f969b0f48cbd4ce4ce027c76f21b53b954b5bf3e5276a47adfa5b0b32a","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-cloud/1.0__ in the __opentofu-2__ workspace
With var files: `tests/workflows/test-cloud/1.0/my_variable.tfvars
`
With variables: `from_variables = "from_variables"`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_id.the_id will be created
  + resource "random_id" "the_id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 5
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + default        = "default"
  + from_tfvars    = "from_tfvars"
  + from_variables = "from_variables"
```
</details>

:memo: Plan generated in [Test Terraform cloud #176](https://github.com/dflook/terraform-github-actions/actions/runs/6592484872)